# AnalyticalModelFloorAlignmentMethod Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelFloorAlignmentMethod Property
ParameterTypeId Class See Also
---
"Alignment Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelFloorAlignmentMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelFloorAlignmentMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelFloorAlignmentMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace